print(100 + 500)
print(300 - 252)
print(34 * 61)
print(50 / 5)

print(30 // 4)  # оператор усеченного деления, делим без остатка
print(6 % 4)  # оператор модуля, показываем остаток

print(4 ** 2)  # возведение в степень

# приоритет вычислений
# Скобки ()
# Степень
# * / // %
# + -

print((40 + 32) / 2)  # пример вычисления среднего числа (про хардкодинг потом :) )

print(sub(square(3), square(1 + 1)))  #Ответ 5, но ошибка говорит о том что он не понимает sub. В JIRA есть вопрос по этому поводу (Интерпретатор)
